//
//                        всякие заплатки
//
@Перевод
{
   @Выбор      чем_что_то1 =
               гр_сущ_И
               гр_сущ_В
               предлог_сущ
               гр_наречия
	       inf
	       фраза_повест
               ;               
   @Выбор      чем_что_то1 =
               гр_сущ_И(%И)
               гр_сущ_В(%В)
               предлог_сущ
               гр_наречия
	       inf
	       фраза_повест
               ;
}
@Перевод
{
   @Структура  чем_что_то = @0[ol]  чем_что_то1 ;
   @Структура  чем_что_то = @0[чем] чем_что_то1 ;
}
// ----------- перевод не-фраз ---------------------------------
@Перевод
{
   @Выбор      не_слово =
               @0[=]
	       @0[*]
	       @0[Б├▓]
               ;               
   @Выбор      не_слово =
               @0[=]
	       @0[*]
	       @0[Б├▓]
               ;
}
@Перевод
{
   @Структура  не_фраза1 = догадка1 не_слово ;
   @Структура  не_фраза1 = догадка1 не_слово ;
}
@Перевод
{
   @Выбор      _не_фраза1 = не_фраза1 @00 ;
   @Выбор      _не_фраза1 = не_фраза1 @00 ;
}
@Перевод
{
   @Структура  не_фраза2 = не_фраза1 _не_фраза1 ;
   @Структура  не_фраза2 = не_фраза1 _не_фраза1 ;
}
@Перевод
{
   @Выбор      _не_фраза2 = не_фраза2 @00 ;
   @Выбор      _не_фраза2 = не_фраза2 @00 ;
}
@Перевод
{
   @Структура  не_фраза = _догадка1 не_слово _не_фраза2 _догадка1 ;
   @Структура  не_фраза = _догадка1 не_слово _не_фраза2 _догадка1 ;
}
